import React from 'react';
import {
  BanglaTitle,
  BanglaText,
  BanglaTime,
  ArabicAyatAndTranslation,
  Hadith,
} from '../../customDesign';
import {
  Container,
  AlertDialog,
  AlertDialogOverlay,
  AlertDialogContent,
  AlertDialogCloseButton,
  AlertDialogBody,
  useDisclosure,
} from '@chakra-ui/react';

export default function DuaForProphetPart3() {
  const { isOpen, onOpen, onClose } = useDisclosure();
  const cancelRef = React.useRef();

  return (
    <Container
      maxW="container.md"
      as="section"
      justifyContent={'center'}
      onCopy={e => {
        e.preventDefault();
        onOpen();
      }}
      onCut={e => {
        e.preventDefault();
        onOpen();
      }}
    >
      <BanglaTitle>
        দরুদ সমাধানের বারুদ: দরুদ প্রেরণের ৭টি বিশেষ বাক্য
      </BanglaTitle>
      <BanglaTime
        Date="11 December, 2022"
        Writer="Nusus"
        windowLocation={window.location.href}
      />
      <BanglaText>
        সহজ ৭ টি দরুদের বাক্য উপস্থাপন করছি। এগুলো গুরুত্বপূর্ণ; সবসময় পড়তে
        পারেন।
      </BanglaText>
      <BanglaText Heading={`(১) দরুদে ইবরাহিম (সর্বশ্রেষ্ঠ দরুদ):`}>
        কা’ব বিন উজরাহ (রা.) রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলেন,
        <Hadith
          Bangla={`
          ‘‘কীভাবে আমরা আপনার উপর এবং আপনার পরিবারবর্গের (আহলে বাইতের) উপর দরুদ পাঠ করবো?’ তখন রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দরুদে ইবরাহিম পাঠ করতে বলেন, যা আমরা প্রত্যেক নামাজের শেষ বৈঠকে তাশাহহুদ (আত্তাহিয়্যাতু...)-এর পর পড়ি। সেটি হলো: আল্লাহুম্মা সল্লি ‘আলা.....হামিদুম মাজিদ। সবারই মুখস্থ আছে, তাই এখানে উল্লেখ করার প্রয়োজনবোধ করছি না। এই দরুদটিই সর্বোত্তম ও সর্বশ্রেষ্ঠ।’’
          `}
          References={`
          ইমাম বুখারি, আস-সহিহ: ৩৩৭০
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(২) সবচেয়ে ছোট বিশুদ্ধ দরুদ:`}>
        রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেন,
        <Hadith
          Arabic={`
        اَللّٰهُمَّ صَلِّ عَلٰى مُحَمَّدٍ، وَعَلٰى آلِ مُحَمَّدٍ
        `}
          Bangla={`
          “হে আল্লাহ! আপনি মুহাম্মাদ এবং মুহাম্মাদের পরিবারের উপর রহমত বর্ষণ করুন।” 
          `}
        />
        রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,
        <Hadith
          Bangla={`
          ‘তোমরা আমার প্রতি দরুদ পড়ো এবং সাধ্যানুযায়ী দু‘আ করো ও বলো (উপরের দরুদটি)।’’
          `}
          References={`
          ইমাম নাসায়ি, আস-সুনান: ১২৯১; হাদিসটি সহিহ
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৩) আরেকটি সুন্দর বিশুদ্ধ দরুদ:`}>
        নবিজি বলেন, ‘‘তোমরা বলো—
        <Hadith
          Arabic={`
          اَللّٰهُمَّ صَلِّ عَلٰى مُحَمَّدٍ النَّبِيِّ الْأُمِّيِّ، وَعَلٰى آلِ مُحَمَّدٍ
        `}
          Bangla={`
          “হে আল্লাহ! আপনি উম্মি নবি মুহাম্মাদ ও মুহাম্মাদের পরিবারের উপর রহমত বর্ষণ করুন।” 
          `}
          References={`
          ইমাম আবু দাউদ, আস-সুনান: ৯৮১; হাদিসটি হাসান
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৪) দরুদে ইবরাহিমের সংক্ষিপ্ত রূপ:`}>
        আবু সাঈদ খুদরি (রা.) থেকে বলেন, আমরা বললাম, ইয়া রাসুলাল্লাহ! আপনার উপর
        সালাম পাঠানোর নিয়ম তো আমরা জেনেছি, কিন্তু আপনার উপর দরুদ কীভাবে পাঠ
        করবো? তিনি বললেন, তোমরা বলবে—
        <Hadith
          Arabic={`
           اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ
        `}
          Bangla={`
          [আল্লা-হুম্মা সল্লি ‘আলা মু‘হাম্মাদিন ‘আবদিকা ওয়া রাসু-লিক, কামা সল্লাইতা ‘আলা ইবরা-হি-ম; ওয়া বা-রিক ‘আলা মু‘হাম্মাদ ওয়া আ-লি মু‘হাম্মাদ, কামা বা-রাকতা ‘আলা ইবরা-হি-ম] --- “হে আল্লাহ! আপনি আপনার বান্দা ও রাসুল মুহাম্মাদের উপর রহমত প্রেরণ করুন, যেভাবে আপনি ইবরাহিমের উপর রহমত প্রেরণ করেছেন। মুহাম্মাদ ও তাঁর পরিবারের উপর বরকত দান করুন, যেভাবে বরকত দিয়েছেন ইবরাহিমের উপর (তাঁর পরিবারের উপর)।”
          `}
          References={`
          ইমাম নাসায়ি, আস-সুনান: ১২৯৩; হাদিসটি সহিহ
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৫) যে দরুদে আছে সাদাকাহর সওয়াব:`}>
        <Hadith
          Arabic={`
          اَللّٰهُمَّ صَلِّ عَلٰى مُحَمَّدٍ عَبْدِكَ وَرَسُوْلِكَ، وَصَلِّ عَلَى الْمُؤْمِنِيْنَ وَالْمُؤْمِنَاتِ، وَالْمُسْلِمِيْنَ وَالْمُسْلِمَاتِ
          `}
          Bangla={`
          আল্লা-হুম্মা সল্লি ‘আলা মু‘হাম্মাদিন ‘আবদিকা ওয়া রাসু-লিক, ওয়া সল্লি ‘আলাল মুঅ্মিনি-না ওয়াল মুঅ্মিনা-ত, ওয়াল মুসলিমি-না ওয়াল মুসলিমা-ত
          `}
          References={`
          হে আল্লাহ! আপনি আপনার বান্দা ও রাসুল মুহাম্মাদের উপর রহমত বর্ষণ করুন এবং সকল মুমিন-মুমিনা ও মুসলিম-মুসলিমার উপরও রহমত বর্ষণ করুন
          `}
        />
        আল্লাহর রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,
        <Hadith
          Bangla={`
          ‘‘যে-মুসলমানের দান-সাদাকাহ করার মতো কিছু নেই, সে যেন দু‘আ করার সময় এটি বলে। এটি তার জন্য জাকাতস্বরূপ।’’
          `}
          References={`
          ইমাম ইবনু হিব্বান, আস-সহিহ: ৯০৩; শায়খ আলবানি ও শু‘আইব আরনাউত্ব (রাহিমাহুমাল্লাহ) হাদিসটির সনদ দুর্বল বলেছেন, তবে অন্য কয়েকজন মুহাদ্দিস হাদিসটির সনদ মোটামুটি গ্রহণযোগ্য (হাসান) বলেছেন
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৬) ছোট একটি দরুদ:`}>
        <Hadith
          Arabic={`
          صَلَّى اللّٰهُ عَلَى النَّبِيِّ مُحَمَّدٍ          `}
          Bangla={`
          সল্লাল্লা-হু ‘আলান্নাবিয়্যি মু‘হাম্মাদ          `}
          References={`
          নবি মুহাম্মাদের উপর আল্লাহ রহমত বর্ষণ করুন।           `}
        />
        নবিজির নাতি হাসান (রা.) হতে বর্ণিত কুনুতের শেষ অংশ এটি। চাইলে এই
        বাক্যটিও দরুদ হিসেবে পড়া যাবে। [ইমাম নাসায়ি, আস-সুনান: ১৭৪৬; হাদিসটির
        সনদ দুর্বল, তবে আমলযোগ্য]
      </BanglaText>
      <BanglaText Heading={`(৭) নবিজির শাফা‘আত লাভের দরুদ:`}>
        <Hadith
          Arabic={`
          اَللّٰهُمَّ صَلِّ عَلٰى مُحَمَّدٍ، وَأَنْزِلْهُ الْمَقْعَدَ الْمُقَرَّبَ عِنْدَكَ يَوْمَ الْقِيَامَةِ
          `}
          Bangla={`
          আল্লা-হুম্মা সল্লি ‘আলা মু‘হাম্মাদ, ওয়া আনযিলহুল মাক্ব‘আদাল মুক্বাররবা ‘ইনদাকা ইয়াওমাল ক্বিয়া-মাহ্
          `}
          References={`
          হে আল্লাহ! আপনি মুহাম্মাদের উপর রহমত বর্ষণ করুন এবং কিয়ামতের দিন আপনার নিকটেই তাঁকে স্থান দিন          `}
        />
        রাসুলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,
        <Hadith
          Bangla={`
          ‘‘যে এটি বলবে, তার জন্য আমার সুপারিশ ওয়াজিব হয়ে যাবে।’’          `}
          References={`
          ইমাম তাবারানি, মু‘জামুল কাবির: ৪৪৮০; ইমাম হাইসামি, মাজমাউয যাওয়াইদ: ১৭৩০৪; হাদিসটির সনদ দুর্বল, তবে আমলযোগ্য          `}
        />
        দরুদের বাক্য নিয়ে অনেক হাদিস বর্ণিত হয়েছে। বিশেষত দরুদে ইবরাহিম শাব্দিক
        পরিবর্তনে অসংখ্য রিওয়ায়াত সহিহ সনদে বর্ণিত হয়েছে। আমরা সেগুলো উল্লেখ
        করিনি। কারণ এগুলোর মধ্যে সবচেয়ে পূর্ণাঙ্গ সেটিই, যেটি আমরা নামাজে পড়ি।
      </BanglaText>
      {/* Copy paste alert dialog */}
      <AlertDialog
        motionPreset="slideInBottom"
        leastDestructiveRef={cancelRef}
        onClose={onClose}
        isOpen={isOpen}
        isCentered
      >
        <AlertDialogOverlay />
        <AlertDialogContent>
          <AlertDialogBody>
            অনুমতি ব্যতিত ব্লগের কোনো পোস্ট কপি করে অন্যত্র প্রকাশ করা যাবে না।
            করা হলে তা লেখকের হক নষ্ট করা হচ্ছে বলে গণ্য হবে।
          </AlertDialogBody>
          <AlertDialogCloseButton bg={'red.500'} />
        </AlertDialogContent>
      </AlertDialog>
    </Container>
  );
}
