import React from 'react';
import {
  BanglaTitle,
  BanglaText,
  BanglaTime,
  ArabicAyatAndTranslation,
  Hadith,
} from '../../customDesign';
import {
  Container,
  AlertDialog,
  AlertDialogOverlay,
  AlertDialogContent,
  AlertDialogCloseButton,
  AlertDialogBody,
  useDisclosure,
} from '@chakra-ui/react';

export default function DuaForProphetPart3() {
  const { isOpen, onOpen, onClose } = useDisclosure();
  const cancelRef = React.useRef();

  return (
    <Container
      maxW="container.md"
      as="section"
      justifyContent={'center'}
      onCopy={e => {
        e.preventDefault();
        onOpen();
      }}
      onCut={e => {
        e.preventDefault();
        onOpen();
      }}
    >
      <BanglaTitle>
        দরুদ সমাধানের বারুদ: নবিজির উপর দরুদ পাঠের অনন্য ১০ টি লাভ ও উপকারিতা
      </BanglaTitle>
      <BanglaTime
        Date="09 December, 2022"
        Writer="Nusus"
        windowLocation={window.location.href}
      />
      <BanglaText Heading={`(১) সকল দুশ্চিন্তামুক্তি ও প্রয়োজন পূরণ:`}>
        একজন সাহাবি রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলেছিলেন, তিনি তাঁর
        উপর সর্বদা দরুদ পাঠ করবেন। তখন রাসুলুল্লাহ্ সাল্লাল্লাহু আলাইহি
        ওয়াসাল্লাম তাঁকে বলেছিলেন,
        <Hadith
          Bangla={`
          ‘‘যদি তুমি তাই করো, তবে তোমার সকল চিন্তা-উৎকণ্ঠা দূর করা হবে (প্রয়োজন পূরণ হবে) এবং তোমার পাপসমূহ ক্ষমা করা হবে।’’
          `}
          References={`
          ইমাম তিরমিযি, আস-সুনান: ২৪৫৭, হাদিসটি হাসান সহিহ
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(২) রহমতপ্রাপ্তি, গুনাহমুক্তি ও মর্যাদাবৃদ্ধি:`}>
        রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেন,
        <Hadith
          Bangla={`
          “যে ব্যক্তি আমার প্রতি একবার দরুদ পাঠ করবে, আল্লাহ তার উপর দশবার রহমত বর্ষণ করবেন।” 
          `}
          References={`
          ইমাম মুসলিম, আস-সহিহ: ৭৯৮
          `}
        />
        নবি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অন্যত্র বলেন,
        <Hadith
          Bangla={`
          ‘‘যে ব্যক্তি আমার প্রতি একবার দরুদ পাঠ করবে, আল্লাহ্ তার প্রতি ১০ বার রহমত বর্ষণ করবেন, তার থেকে ১০ টি গুনাহ মুছে দেওয়া হবে এবং তার জন্য ১০ টি স্তর উন্নীত করা হবে।’’
          `}
          References={`
          ইমাম নাসায়ি, আস-সুনান: ১২৯৭; হাদিসটি সহিহ
          `}
        />
        অন্য বর্ণনায় এসেছে, নবিজি বলেন,
        <Hadith
          Bangla={`
          ‘‘আমার উম্মতের যে ব্যক্তি মন থেকে ইখলাসের (একনিষ্ঠতার) সাথে আমার উপর একবার দরুদ প্রেরণ করবে, আল্লাহ্ তার প্রতি ১০ বার রহমত বর্ষণ করবেন, তার জন্য ১০ টি স্তর উন্নীত করবেন, তার জন্য ১০ টি নেকি লিখবেন এবং তার থেকে ১০ টি গুনাহ মুছে দেবেন।’’
          `}
          References={`
          ইমাম নাসায়ি, আস-সুনানুল কুবরা: ৯৮৯৩; ইমাম বাযযার, আল-মুসনাদ: ৩৭৯৯; হাদিসটি হাসান
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৩) দরুদ মুমিনের জন্য জাকাতস্বরূপ:`}>
        নবি করিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,
        <Hadith
          Bangla={`
          ‘‘আমার উপর দরুদ পড়ো। কেননা এটা তোমাদের জন্য জাকাতস্বরূপ।’’
          `}
          References={`
          ইমাম আহমাদ, আল-মুসনাদ: ৮৭৭০; হাদিসটির সনদ দুর্বল
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৪) কিয়ামতের মাঠে নবিজির সান্নিধ্য:`}>
        রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন,
        <Hadith
          Bangla={`
          “কিয়ামতের দিন সেই ব্যক্তি সব লোকের চাইতে আমার বেশি নিকটবর্তী হবে, যে তাদের মধ্যে সবচেয়ে বেশি আমার উপর দরুদ পড়বে।”
          `}
          References={`
          ইমাম তিরমিযি, আস-সুনান: ৪৮৪; শায়খ আলবানি, সহিহুত তারগিব: ১৬৮৮; হাদিসটি হাসান (Al Hadith অ্যাপে হাদিসটিকে ‘দুর্বল’ দেখাচ্ছে। তবে, বাস্তবতা হলো, শায়খ আলবানি প্রথমে হাদিসটিকে ‘দুর্বল’ বললেও পরে মত পরিবর্তন করে ‘হাসান’ বলেছেন
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৫) রাসুলের কাছে দরুদ পেশ করা হয়:`}>
        রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন,
        <Hadith
          Bangla={`
          “তোমাদের দিনগুলোর মধ্যে সর্বোত্তম দিন হচ্ছে জুমু‘আর দিন।...সুতরাং এই দিনে তোমরা আমার উপর বেশি করে দরুদ পড়ো। কেননা, তোমাদের দরুদ আমার কাছে উপস্থাপন করা হয়।”
          `}
          References={`
          ইমাম আবু দাউদ, আস-সুনান: ১০৪৭; হাদিসটি সহিহ
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৬) নবিজির শাফা‘আত (সুপারিশ) লাভ:`}>
        রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন,
        <Hadith
          Bangla={`
          , ‘‘যে ব্যক্তি আমার প্রতি সকালে ১০ বার এবং বিকালে ১০ বার দরুদ পাঠ করবে, সে ব্যক্তি কিয়ামতের দিন আমার শাফা‘আত (সুপারিশ) লাভ করবে।’’
          `}
          References={`
          ইমাম হাইসামি, মাজমাউয যাওয়াইদ: ১৭০২২; শায়খ আলবানি, সিলসিলা দ্বয়িফাহ: ৫৭৮৮; হাদিসটির সনদকে শায়খ আলবানি ‘দুর্বল’ বললেও ইমাম সাখাবি এর একটি সনদকে ‘জায়্যিদ’ বলেছেন এবং ইমাম সুয়ুতি ‘হাসান’ বলেছেন
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৭) দরুদ দু‘আ কবুলের অন্যতম উপায়:`}>
        একবার রাসুল সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এক ব্যক্তিকে নামাজে দু‘আ
        করতে শুনলেন। সে আল্লাহর প্রশংসাও করলো না, নবিজির উপর দরুদও পড়লো না। তখন
        নবিজি তাকে বললেন,
        <Hadith
          Bangla={`
          ‘‘হে মুসল্লি! তুমি খুব তাড়াহুড়া করে ফেললে!’’ তারপর নবিজি তাদের শিক্ষা দিলেন (কীভাবে দু‘আ করতে হয়)। তখন তিনি এক ব্যক্তিকে দেখলেন, সে নামাজ আদায় করলো এবং আল্লাহর গুণ (মাহাত্ম্য) বর্ণনা করলো, তাঁর প্রশংসা করলো এবং রাসুলের উপর দরুদ পাঠ করলো। তখন নবিজি (তাকে) বললেন, ‘‘তুমি দু‘আ কর, কবুল করা হবে; (আল্লাহর কাছে) চাও, তোমাকে দেওয়া হবে।’’
          `}
          References={`
          ইমাম নাসায়ি, আস-সুনান: ১২৮৪; হাদিসটি সহিহ
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৮) রাসুলের দু‘আ লাভের সুযোগ:`}>
        রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,
        <Hadith
          Bangla={`
          ‘যে ব্যক্তি আমার উপর একবার দরুদ পাঠ করে, আমি তার জন্য ১০ বার সালাত পাঠ করি (দু‘আ করি)।’’
          `}
          References={`
          ইমাম তাবারানি, মু‘জামুল আউসাত্ব: ১৬৪২; ইমাম তাবারানি হাদিসটির সনদ নির্ভরযোগ্য বলেছেন
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৯) দরুদ (গুনাহর) কাফফারাস্বরূপ:`}>
        রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,
        <Hadith
          Bangla={`
          ‘‘তোমরা আমার উপর দরুদ পড়ো। কেননা, আমার উপর দরুদ পড়া তোমাদের জন্য কাফফারা (প্রায়শ্চিত্ত)।’’ 
          `}
          References={`
          ইমাম ইবনু আবি আসিম, আস সলাতু ‘আলান নাবিয়্যি: ৭৮, ইমাম ইবনু হাজারের মতে, হাদিসের রাবিগণ সহিহ হাদিসের রাবি
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(১০) অনন্য মর্যাদা ও বৈশিষ্টপূর্ণ আমল:`}>
        কুরআন কারিমে এসেছে,
        <ArabicAyatAndTranslation
          Translation={`
          ‘‘নিশ্চয়ই আল্লাহ্ ও তাঁর ফেরেশতাগণ নবির প্রতি সালাত (দরুদ) প্রেরণ করেন। হে মুমিনগণ! তোমরাও তাঁর প্রতি সালাত (দরুদ) ও সালাম প্রেরণ করো।’’ 
          `}
          Surah={`আহযাব`}
          Ayat={`৫৬`}
        />
        আল কুরআনে অন্য কোনো আমলের ক্ষেত্রে এমনটি বলা হয়নি যে, ‘স্বয়ং আল্লাহ্ ও
        তাঁর ফেরেশতাগণ এরূপ করেন, সুতরাং তোমরাও করো।’ নিঃসন্দেহে এটি দরুদের
        বিশেষ মর্যাদা ও অনন্য বৈশিষ্টের প্রমাণ।
        <br />
        আল্লাহ্ তা‘আলা আমাদের তাওফিক দিন, যেন আমরা সর্বাবস্থায় রাসুলের উপর দরুদ
        পাঠ করতে পারি এবং দরুদময় জীবন গঠন করতে পারি।
      </BanglaText>
      {/* Copy paste alert dialog */}
      <AlertDialog
        motionPreset="slideInBottom"
        leastDestructiveRef={cancelRef}
        onClose={onClose}
        isOpen={isOpen}
        isCentered
      >
        <AlertDialogOverlay />
        <AlertDialogContent>
          <AlertDialogBody>
            অনুমতি ব্যতিত ব্লগের কোনো পোস্ট কপি করে অন্যত্র প্রকাশ করা যাবে না।
            করা হলে তা লেখকের হক নষ্ট করা হচ্ছে বলে গণ্য হবে।
          </AlertDialogBody>
          <AlertDialogCloseButton bg={'red.500'} />
        </AlertDialogContent>
      </AlertDialog>
    </Container>
  );
}
