import React from 'react';
import {
  BanglaTitle,
  BanglaText,
  ArabicAyatAndTranslation,
  BanglaTime,
  Hadith,
} from '../../customDesign';
import {
  Container,
  AlertDialog,
  AlertDialogOverlay,
  AlertDialogContent,
  AlertDialogCloseButton,
  AlertDialogBody,
  useDisclosure,
} from '@chakra-ui/react';

export default function DuaForProphetPart1() {
  const { isOpen, onOpen, onClose } = useDisclosure();
  const cancelRef = React.useRef();

  return (
    <Container
      maxW="container.md"
      as="section"
      justifyContent={'center'}
      onCopy={e => {
        e.preventDefault();
        onOpen();
      }}
      onCut={e => {
        e.preventDefault();
        onOpen();
      }}
    >
      <BanglaTitle>দরুদ সমাধানের বারুদ: দরুদ জিনিসটা আসলে কী, নবিজির উপর আমাদের দরুদ পড়ার হিকমাহ ও যৌক্তিকতা কী?</BanglaTitle>
      <BanglaTime
        Date="04 December, 2022"
        Writer="Nusus"
        windowLocation={window.location.href}
      />

      <BanglaText>
        প্রথমেই জেনে রাখি: দরুদ শব্দটি ফার্সি; কুরআন-হাদিসে ‘সালাত’ শব্দটি এসেছে
        দরুদ বোঝাতে। আল্লাহ তা‘আলা বলেন,
        <ArabicAyatAndTranslation
          Translation={`
          ‘‘নিশ্চয়ই আল্লাহ ও তাঁর ফেরেশতাগণ নবির
        প্রতি সালাত প্রেরণ করেন। হে মুমিনগণ! তোমরাও তাঁর প্রতি প্রচুর পরিমাণে
        সালাত ও সালাম প্রেরণ করো।’’
          `}
          Surah={`আহযাব`}
          Ayat={`৫৬`}
        />
      </BanglaText>

      <BanglaText>
        আল্লাহ্ ঈমানদারদের উদ্দেশ্যে বলেন,
        <ArabicAyatAndTranslation
          Translation={`
          ‘তিনি (আল্লাহ) তোমাদের প্রতি সালাত প্রেরণ করেন এবং তাঁর ফেরেশতাগণও।’’ 
          `}
          Surah={`আহযাব`}
          Ayat={`৪৩`}
        />
      </BanglaText>
      <BanglaText>
        সালাতের অর্থ ও মর্ম কী, এ নিয়ে আলিমগণ বিভিন্ন মত দিয়েছেন। সবচেয়ে
        প্রসিদ্ধ ও উত্তম মত হলো: আল্লাহ যখন সালাত প্রেরণ করেন, তখন এর উদ্দেশ্য
        হবে, রহমত বর্ষণ করা, সম্মানিত করা; ফেরেশতাগণ যখন কারো উপর সালাত প্রেরণ
        করেন, তখন এর উদ্দেশ্য হবে, তার জন্য আল্লাহর কাছে ইস্তিগফার (ক্ষমা
        প্রার্থনা) করা এবং ঈমানদাররা যখন সালাত প্রেরণ করেন, তখন এর উদ্দেশ্য হবে,
        আল্লাহর কাছে রহমত বর্ষণ ও মর্যাদা বৃদ্ধির জন্য দু‘আ করা।
      </BanglaText>
      <BanglaText>
        সুতরাং আমরা যে নবিজির উপর সালাত (দরুদ) প্রেরণ করি, এর মানে হলো, আমরা
        আল্লাহর নিকট তাঁর জন্য রহমত কামনা করি এবং তাঁর মর্যাদা বৃদ্ধির জন্য দু‘আ
        করি।
      </BanglaText>
      <BanglaText
        Heading={`নবিজির উপর দরুদ পাঠের উদ্দেশ্য ও এর পেছনে থাকা হিকমাহ (প্রজ্ঞা) ও যৌক্তিকতা:`}
      >
        আল্লামা হালিমি (রাহিমাহুল্লাহ্) তাঁর ‘শু‘আবুল ঈমান’ গ্রন্থে বলেন,
        <Hadith
          Bangla={`
          ‘নবি সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের উপর সালাত বা দরুদ পাঠের উদ্দেশ্য হলো, আল্লাহর আদেশ পালনের মাধ্যমে (উপরে বর্ণিত আয়াতে আল্লাহ আদেশ করছেন দরুদ পড়তে) আল্লাহর নৈকট্য অর্জন করা এবং আমাদের উপর নবি সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের যে অধিকার আছে, তা আদায় করা।’
          `}
          References={`
          ইমাম ইবনু হাজার, ফাতহুল বারি: ১৪/৩৯২; আল্লামা মুবারকপুরী, মির‘আতুল মাফাতিহ: ৩/২৫২
          `}
        />
        ইমাম আল ‘ইয ইবনু আবদিস সালাম (রাহিমাহুল্লাহ) বলেন,
        <Hadith
          Bangla={`
          ‘নবি সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের জন্য আমাদের প্রেরিত দরুদ আমাদের পক্ষ থেকে তাঁর জন্য কোনো সুপারিশ নয়। কারণ আমাদের মত (নগন্য) মানুষেরা তাঁর জন্য সুপারিশ করতে পারে না। কিন্তু যারা আমাদের কল্যাণ সাধন করে, আমাদের প্রতি অনুগ্রহ করে, তাদের প্রতিদান দিতে আল্লাহ আমাদেরকে আদেশ দিয়েছেন। যদি আমরা সেটা করতে অক্ষম হই, তাহলে (অন্তত) তাদের জন্য দু‘আ করবো। আল্লাহ যেহেতু জানেন যে, আমরা নবিজিকে প্রতিদান দিতে অক্ষম, সেহেতু তাঁর জন্য সালাত (দরুদ) পাঠ করতে বলেছেন; যাতে আমাদের প্রতি তাঁর অনুগ্রহ এবং দানের প্রতিদানটা সালাত (দরুদ) পাঠের মাধ্যমে হয়। কেননা আমাদের প্রতি নবিজির অনুগ্রহের মত মহান আর কোনো অনুগ্রহ নেই।’
          `}
          References={`
          আল্লামা সালিহি, সুবুলুল হুদা ওয়ার রাশাদ: ১২/৪১১
          `}
        />
        ইমাম ইবনুল কায়্যিম (রাহ.) বলেন,
        <Hadith
          Bangla={`
          ‘কোনো ব্যক্তি যদি আল্লাহর রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের ওপর নিঃশ্বাস সমপরিমাণ দরুদ ও সালাম পড়ে, তবুও সে নবিজির হক আদায় করতে সক্ষম হবে না।’
          `}
          References={`
          জালাউল আফহাম, পৃষ্ঠা: ৩৪৪
          `}
        />
      </BanglaText>
      <BanglaText>
        প্রকৃত অর্থেই নবি করিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুনিয়াতে থাকতে
        উম্মতের জন্য যে ত্যাগ স্বীকার করেছেন এবং হাশরের মাঠেও যেভাবে (আল্লাহর
        ইচ্ছায়) উম্মতের মুক্তির জন্য প্রাণপণ চেষ্টা করবেন, সেই হিসেবে আমাদের উপর
        তাঁর অনুগ্রহ সীমাহীন। সুতরাং, আমাদের উচিত সাধ্যানুযায়ী খুব বেশি পরিমাণে
        তাঁর উপর সালাত (দরুদ) প্রেরণ করা। আরেকটি বিষয় হলো, নবিজির উপর সালাম
        প্রেরণ করা। এটি আমরা সবাই বুঝি। তবুও এ সংক্রান্ত সুস্পষ্ট আলোচনা সামনে
        আসবে।
      </BanglaText>
      <AlertDialog
        motionPreset="slideInBottom"
        leastDestructiveRef={cancelRef}
        onClose={onClose}
        isOpen={isOpen}
        isCentered
      >
        <AlertDialogOverlay />
        <AlertDialogContent>
          <AlertDialogBody>
            অনুমতি ব্যতিত ব্লগের কোনো পোস্ট কপি করে অন্যত্র প্রকাশ করা যাবে না।
            করা হলে তা লেখকের হক নষ্ট করা হচ্ছে বলে গণ্য হবে।
          </AlertDialogBody>
          <AlertDialogCloseButton bg={'red.500'} />
        </AlertDialogContent>
      </AlertDialog>
    </Container>
  );
}
