import React from 'react';
import {
  BanglaTitle,
  BanglaText,
  BanglaTime,
  ArabicAyatAndTranslation,
  Hadith,
} from '../../customDesign';
import {
  Container,
  AlertDialog,
  AlertDialogOverlay,
  AlertDialogContent,
  AlertDialogCloseButton,
  AlertDialogBody,
  useDisclosure,
} from '@chakra-ui/react';

export default function DuaForProphetPart3() {
  const { isOpen, onOpen, onClose } = useDisclosure();
  const cancelRef = React.useRef();

  return (
    <Container
      maxW="container.md"
      as="section"
      justifyContent={'center'}
      onCopy={e => {
        e.preventDefault();
        onOpen();
      }}
      onCut={e => {
        e.preventDefault();
        onOpen();
      }}
    >
      <BanglaTitle>দরুদ সমাধানের বারুদ: দরুদ পড়ার সময় ও পরিস্থিতি</BanglaTitle>
      <BanglaTime
        Date="14 December, 2022"
        Writer="Nusus"
        windowLocation={window.location.href}
      />
      <BanglaText>
        নবিজির উপর দরুদ পড়ার অপরিসীম লাভের কথা আমরা জেনেছি। এবার আমরা দরুদ পাঠের
        বিশেষ মুহূর্ত ও সময়গুলো জানবো।
        <br />
        মূলত, দিনে-রাতে সবসময়, সব অবস্থায় দরুদ পাঠ করা জায়েয। তবে, বিশেষ কিছু
        সময়ে এর গুরুত্ব, লাভ ও মর্যাদা অনেক বেশি। সেগুলো নিচে আলোচনা করা হলো।
      </BanglaText>
      <BanglaText Heading={`(১) কোনো মজলিসে বসলে:`}>
        রাসুলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,
        <Hadith
          Bangla={`
          ‘‘কিছু মানুষ যখন কোনো মজলিসে (বৈঠকে) বসে, সেখানে যদি তারা আল্লাহর যিকর না করে এবং তাদের নবির উপর সালাত (দরুদ) পাঠ না করে, তবে তা তাদের জন্য পরিতাপ-আফসোসের কারণ হবে। ইচ্ছা করলে আল্লাহ তাদের শাস্তি দেবেন আর ইচ্ছা করলে তিনি তাদের মাফ করে দেবেন।’’          `}
          References={`
          ইমাম তিরমিযি, আস-সুনান: ৩৩৮০; হাদিসটি সহিহ          `}
        />
      </BanglaText>
      <BanglaText Heading={`(২) দু‘আ শুরু করার পূর্বে:`}>
        ইবনু মাস‘উদ (রা.) বলেন,
        <Hadith
          Bangla={`
          “তোমাদের কেউ যখন আল্লাহর কাছে কিছু চাবে (দু‘আ করবে), তখন সে যেন আল্লাহর শান অনুযায়ী প্রশংসা ও গুণ বর্ণনা করে। অতঃপর নবিজির উপর দরুদ পাঠ করবে। এরপর দু‘আ করবে। এটি (এই পদ্ধতিটি) সফল হওয়ার অধিক উপযোগী।” 
          `}
          References={`
          ইমাম আবদুর রাযযাক, আল-মুসান্নাফ: ১৯৬৪২; ইমাম তাবারানি, মু‘জামুল কাবির: ৮৭৮০; একাধিক মুহাদ্দিস বর্ণনাটিকে গ্রহণযোগ্য বলেছেন
          `}
        />
        আলি (রা.) বলেন,
        <Hadith
          Bangla={`
          ‘‘সকল দু‘আ পর্দার আড়ালে থাকবে, যতক্ষণ না নবির উপর সালাত পাঠ করবে।’’
          `}
          References={`
          ইমাম তাবারানি, মু‘জামুল আওসাত্ব: ৭২১; শায়খ আলবানি, সিলসিলা সহিহাহ: ২০৩৫; বর্ণনাটি হাসান
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৩) রাসুলের আলোচনা বা নাম উচ্চারিত হলে:`}>
        নবিজি বলেন,
        <Hadith
          Bangla={`
          ‘‘কৃপণ ঐ ব্যক্তি, যার সামনে আমার আলোচনা করা হলো, অথচ সে আমার জন্য দরুদ পাঠ করলো না।’’
          `}
          References={`
          ইমাম তিরমিযি, আস-সুনান: ৩৫৪৬; হাদিসটি সহিহ
          `}
        />
        নবি করিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বেশ কঠিন ভাষায় বলেছেন,
        <Hadith
          Bangla={`
            ‘‘ওই ব্যক্তির নাক ধূলি-ধুসরিত হোক (অপদস্থ হোক), যার সামনে আমার আলোচনা করা হলো, অথচ সে আমার জন্য দরুদ পাঠ করলো না।’’
            `}
          References={`
            ইমাম তিরমিযি, আস-সুনান: ৩৫৪৫; হাদিসটি হাসান সহিহ
            `}
        />
      </BanglaText>
      <BanglaText Heading={`(৪) দুশ্চিন্তা ও বিপদ-মুসিবতে:`}>
        একজন সাহাবি রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলেছিলেন, তিনি তাঁর
        উপর সর্বদা দরুদ পাঠ করবেন। তখন রাসুলুল্লাহ্ সাল্লাল্লাহু আলাইহি
        ওয়াসাল্লাম তাঁকে বলেছিলেন,
        <Hadith
          Bangla={`
          ‘‘যদি তুমি তাই করো, তবে তোমার সকল চিন্তা-উৎকণ্ঠা দূর করা হবে (প্রয়োজন পূরণ হবে) এবং তোমার পাপসমূহ ক্ষমা করা হবে।’’
          `}
          References={`
          ইমাম তিরমিযি, আস-সুনান: ২৪৫৭, হাদিসটি হাসান সহিহ          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৫) জুমু‘আর দিনে ও রাতে:`}>
        রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন,
        <Hadith
          Bangla={`
          “তোমাদের দিনগুলোর মধ্যে সর্বোত্তম দিন হচ্ছে জুমু‘আর দিন।...সুতরাং এই দিনে তোমরা আমার উপর বেশি করে দরুদ পড়ো। কেননা, তোমাদের দরুদ আমার কাছে উপস্থাপন করা হয়।”
          `}
          References={`
          ইমাম আবু দাউদ, আস-সুনান: ১০৪৭; হাদিসটি সহিহ
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৬) মসজিদে প্রবেশ ও বের হতে:`}>
        আবু হুরায়রা (রা.) বলেন, নবি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,
        <Hadith
          Bangla={`
          ‘‘তোমাদের কেউ যখন মসজিদে প্রবেশ করে, সে যেন নবির উপর দরুদ প্রেরণ করে, অতঃপর বলে...(মসজিদে প্রবেশের দু‘আটি) এবং যখন বের হয়, তখন যেন নবির উপর দরুদ প্রেরণ করে, অতঃপর বলে...(মসজিদ থেকে বের হওয়ার দু‘আটি)।’’
          `}
          References={`
          ইমাম ইবনু মাজাহ, আস-সুনান: ৭৭৩; ইমাম তিরমিযি, আস-সুনান: ৩১৪; হাদিসটি সহিহ
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৭) আজানের পর:`}>
        রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,
        <Hadith
          Bangla={`
          ‘‘যখন তোমরা মুয়াজ্জিনকে আজান দিতে শুনবে, তখন সে যেরূপ বলে, তোমরাও তদ্রুপ বলবে। অতঃপর তোমরা (আজান শেষে) আমার প্রতি দরুদ পাঠ করবে। কেননা যে ব্যক্তি আমার উপর একবার দরুদ পাঠ করবে, আল্লাহ তা‘আলা তার উপর দশটি রহমত অবতীর্ণ করবেন। অতঃপর তোমরা আল্লাহর নিকট আমার জন্য ওসিলা প্রার্থনা করবে...।’’
                    `}
          References={`
          ইমাম মুসলিম, আস-সহিহ: ৭৩৫
          `}
        />
      </BanglaText>
      <BanglaText Heading={`(৮) সকাল-সন্ধ্যায় ১০ বার করে:`}>
        রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন,
        <Hadith
          Bangla={`
          ‘‘যে ব্যক্তি আমার প্রতি সকালে ১০ বার এবং বিকালে ১০ বার দরুদ পাঠ করবে, সে ব্যক্তি কিয়ামতের দিন আমার শাফা‘আত (সুপারিশ) লাভ করবে।’’
          `}
          References={`
          ইমাম হাইসামি, মাজমাউয যাওয়াইদ: ১৭০২২; শায়খ আলবানি, সিলসিলা দ্বয়িফাহ: ৫৭৮৮; হাদিসটির সনদকে শায়খ আলবানি ‘দুর্বল’ বললেও ইমাম সাখাবি এর একটি সনদকে ‘জায়্যিদ’ বলেছেন এবং ইমাম সুয়ুতি ‘হাসান’ বলেছেন
          `}
        />
      </BanglaText>
      <BanglaText>
        এছাড়াও— <br />
        ◗প্রত্যেক নামাজের শেষ বৈঠকে দরুদ পড়তে হয়। <br />
        ◗জানাযার নামাজের দ্বিতীয় তাকবিরের পর দরুদ পড়তে হয়। <br />
        ◗নবি সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের কবর জিয়ারতে দরুদ পড়তে হয়। <br />
        ◗দু‘আ কুনুতেও দরুদ পড়া যায়। <br />
        ◗এছাড়াও যেকোনো সময়ে, যেকোনো অবস্থায় দরুদ পাঠ করা যায়। অজু ছাড়াও পড়া যায়।
      </BanglaText>

      {/* Copy paste alert dialog */}
      <AlertDialog
        motionPreset="slideInBottom"
        leastDestructiveRef={cancelRef}
        onClose={onClose}
        isOpen={isOpen}
        isCentered
      >
        <AlertDialogOverlay />
        <AlertDialogContent>
          <AlertDialogBody>
            অনুমতি ব্যতিত ব্লগের কোনো পোস্ট কপি করে অন্যত্র প্রকাশ করা যাবে না।
            করা হলে তা লেখকের হক নষ্ট করা হচ্ছে বলে গণ্য হবে।
          </AlertDialogBody>
          <AlertDialogCloseButton bg={'red.500'} />
        </AlertDialogContent>
      </AlertDialog>
    </Container>
  );
}
