import React from 'react';
import {
  BanglaTitle,
  BanglaText,
  ArabicAyatAndTranslation,
  BanglaTime,
  BulletPoint,
} from '../../customDesign';
import {
  Box,
  Text,
  Container,
  Button,
  AlertDialog,
  AlertDialogOverlay,
  AlertDialogContent,
  AlertDialogHeader,
  AlertDialogCloseButton,
  AlertDialogBody,
  AlertDialogFooter,
  useDisclosure,
} from '@chakra-ui/react';

export default function Islam_on_womens_rights_and_dignity() {
  const { isOpen, onOpen, onClose } = useDisclosure();
  const cancelRef = React.useRef();

  return (
    <Container
      maxW="container.md"
      as="section"
      justifyContent={'center'}
      onCopy={e => {
        e.preventDefault();
        onOpen();
      }}
      onCut={e => {
        e.preventDefault();
        onOpen();
      }}
    >
      <BanglaTitle>নারীর অধিকার ও মর্যাদায় ইসলাম</BanglaTitle>
      <BanglaTime
        Date="12 November, 2022"
        Writer="মাসিক আত তাহরীক"
        windowLocation={window.location.href}
      />

      <BanglaText Heading={`ভূমিকা:`}>
        মহান আল্লাহর নিকট ইসলামই একমাত্র মনােনীত দ্বীন (আলে ইমরান ১৯)। আর এই
        দ্বীনে মহান আল্লাহ নারীর মর্যাদাকে উর্ধ্বে তুলে ধরেছেন। নর-নারীর
        সমন্বয়েই মানব জাতি। নারী জাতি হ'ল মহান আল্লাহর এক বিশেষ নে'মত। আল্লাহ
        তা'আলা নারীকে পুরুষের জীবন সঙ্গিনী হিসাবে মানব জীবন পরিচালনার জন্য
        পারস্পরিক সহযােগী করেছেন। ইসলাম মর্যাদার দিক দিয়ে নারীকে পুরুষের থেকে
        ভিন্ন করে দেখেনি। বরং ইসলামের আগমনেই নির্যাতিত, নিপীড়িত, অবহেলিত নারী
        সমাজ পেয়েছে মুক্তির সন্ধান। সারা দুনিয়াতে যখন নারীরা নিদারুণ অবস্থায়।
        কালাতিপাত করছিল, আরব, ইউরােপ ও অন্যান্য দেশে তাদেরকে জন্তু-জানােয়ার বলে
        মনে করা হ'ত এবং মানুষ হিসাবে তাদের কোন মর্যাদা ও অধিকার স্বীকার করা হ'ত
        না, তখন ইসলাম নারীর যথাযথ অধিকার ও মর্যাদা প্রদান করে নারী। জাতিকে
        সম্মানের সুউচ্চ আসনে অধিষ্ঠিত করেছে। যেমন আল্লাহ তা'আলা পুরুষদের প্রতি
        ইঙ্গিত করে বলেন,
        <ArabicAyatAndTranslation
          Arabic={`
          هُنَّ لِبَاسٌ لَكُمْ وَأَنْتُمْ لِبَاسٌ لَهُنَّ
          `}
          Translation={`তারা তােমাদের পােশাক এবং তােমরা তাদের পােশাক`}
          Surah={`বাকারাহ`}
          Ayat={`১৮৭`}
        />
        তিনি আরাে বলেন,
        <ArabicAyatAndTranslation
          Arabic={`
          يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالًا كَثِيرًا وَنِسَاءً ۚ وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ ۚ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا
          `}
          Translation={`হে মানব সকল! তােমরা তােমাদের স্বীয় 
          প্রতিপালককে ভয় কর, যিনি তােমাদেরকে একই আত্মা (আদম) 
          হ'তে সৃষ্টি করেছেন এবং ঐ আত্মা হ'তে তাঁর জোড়া (হাওযা) -কে 
          সৃষ্টি করেছেন এবং এতদুভ্য হ'তে বহু নর ও নারী বিস্তার। করেছেন। 
          আর তােমরা আল্লাহকে ভয় কর, যাঁর নামে তােমরা পরস্পরের নিকট 
          (স্বীয হকের) দাবী করে থাক এবং আত্মীয়তা (এর হক বিনষ্ট করা) হ'তেও 
          ভয় কর। নিশ্চয়ই আল্লাহ তােমাদের সকলের খবর রাখেন`}
          Surah={`নিসা`}
          Ayat={`১`}
        />
      </BanglaText>

      <BanglaText Heading={`ইসলামে নারীর অধিকার ও মর্যাদা:`}>
        মর্যাদা অর্থ- গৌরব, সম্ভ্রম, সম্মান, মূল্য ইত্যাদি। আর নারীর মর্যাদা
        বলতে নারীর ন্যায়-সঙ্গত অধিকারকে বুঝায়। আর অধিকার অর্থ প্রাপ্য, পাওনা
        ইত্যাদি। কারো অধিকার প্রদানের অর্থ হচ্ছে তার প্রাপ্য বা পাওনা যথাযথভাবে
        প্রদান করা। আর এ প্রাপ্য বা পাওনা বলতে তার অধিকারের স্বীকৃতি, কর্তব্যের
        সঠিক বিশ্লেষণ ও সামাজিক জীবনে তার অবদানের যথার্থ মূল্যায়নই বুঝানো হয়।
        সুতরাং নারী অধিকার বলতে পারিবারিক, সামাজিক, রাজনৈতিক, অর্থনৈতিক, জাতীয় ও
        আন্তর্জাতিক তথা সকল ক্ষেত্রে নারীর যথার্থ মূল্যায়নকেই বুঝানো হয়। অতএব
        যদি কারো ন্যায্য অধিকার স্বীকার না করা হয়, অথবা তার কর্তব্যে বাধা দান বা
        তার সামর্থ্যের অধিক কোন দায়িত্ব-কর্তব্য তার উপর চাপিয়ে দেওয়া হয়, কিংবা
        তার অবদান সমূহের সঠিক মূল্যায়ন না করা হয়, তাহ’লে তার অধিকার ও মর্যাদা
        খর্ব করা হবে এবং তার প্রতি অবিচার করা হবে। আর যখন তার অধিকার সমূহ
        স্বীকার করা হয়, তার সামর্থ্য অনুসারে তাকে দায়িত্ব-কর্তব্য আদায় করার
        পূর্ণ সুযোগ দান করা হয় এবং সামাজিক জীবনে তার অবদান সমূহের মূল্যায়ন করা
        হয়, তখন তার উপযুক্ত মর্যাদা দান করা হয়েছে বলে ধরে নেওয়া যায়।
      </BanglaText>

      <BanglaText Heading={`ইসলাম পূর্ব যুগে নারীর অবস্থান :`}>
        ইসলাম পূর্ব যুগে নারী ছিল সবচেয়ে অবহেলিত, লাঞ্চিত, বঞ্চিত, নির্যাতিত এবং
        অধিকার হারা জাতি। সে সময় নারীকে ভোগ-বিলাসের উপকরণ এবং বাজারের পণ্য
        হিসাবে গণ্য করা হ’ত। সেই সময়ে নারীদেরকে মানুষ হিসাবে যথাযোগ্য মর্যাদা
        দেয়া হ’ত না এবং তাদের কোন সামাজিক অধিকার স্বীকৃত ছিল না। এমনকি মানব
        জাতির একটি অবিচ্ছেদ্য অংশ হিসাবে সমাজে বেঁচে থাকার অধিকারটুকুও ছিল না।
        তাদের প্রতি খুবই কঠোর আচরণ করা হ’ত। সে যুগে নারীদেরকে মনে করা হ’ত দাসী
        এবং ভারবাহী পশু হিসাবে। যাদেরকে ক্রয়-বিক্রয় করা হ’ত। সে আমলে স্বামী যত
        খুশি স্ত্রী গ্রহণ করত এবং ইচ্ছা করলে তার স্ত্রীকে অপরের কাছে বিক্রি করে
        দিতে পারত কিংবা স্ত্রীকে দিয়েই কেউ ঋণ পরিশোধ করত। আবার কেউ উপহার হিসাবে
        কাউকে এমনিই দিয়ে দিত। তারা কন্যা সন্তান জন্মকে লজ্জাজনক মনে করে স্বীয়
        নিষ্পাপ কন্যা সন্তানকে জীবন্ত কবর দিতেও কুণ্ঠিত হ’ত না। তাদের এমন বিবেক
        বর্জিত কর্ম সম্পর্কে মহান আল্লাহ বলেন,
        <ArabicAyatAndTranslation
          Arabic={`
          وَإِذَا الْمَوْؤُوْدَةُ سُئِلَتْ، بِأَيِّ ذَنْبٍ قُتِلَتْ
          `}
          Translation={`আর যখন জীবন্ত সমাধিস্থ কন্যাকে জিজ্ঞেস করা হবে, কি অপরাধে তাকে হত্যা করা হয়েছিল?`}
          Surah={`তাকভীর `}
          Ayat={`৮-৯`}
        />
      </BanglaText>
      <BanglaText>
        সেযুগে তারা পিতা-মাতা বা স্বামীর মৃত্যুর পর পরিত্যক্ত সম্পত্তি থেকেও
        বঞ্চিত হ’ত। পিতৃহীনা সুন্দরী-ধনবতী বালিকার অভিভাবক যথাযথ মোহর দানে তাকে
        বিবাহ করতে সম্মত হ’ত না। আবার অন্যত্র বিবাহ দিতেও অসম্মতি প্রকাশ করত।
        সুন্দরী বাঁদী দ্বারা দেহ ব্যবসা করিয়ে অর্থ উপার্জন করা হ’ত। এ গর্হিত কাজ
        হ’তে বিরত রাখার উদ্দেশ্যে আল্লাহ তা‘আলা এ আয়াত অবতীর্ণ করেন,
        <ArabicAyatAndTranslation
          Arabic={`
          وَلاَ تُكْرِهُوْا فَتَيَاتِكُمْ عَلَى الْبِغَاءِ إِنْ أَرَدْنَ تَحَصُّناً لِّتَبْتَغُوْا عَرَضَ الْحَيَاةِ الدُّنْيَا
          `}
          Translation={`
          আর তোমরা দুনিয়ার ধন-সম্পদ লাভের উদ্দেশ্যে তোমাদের যুবতী দাসীদেরকে ব্যভিচারে লিপ্ত হ’তে বাধ্য করবে না। যখন তারা পাপমুক্ত থাকতে চায়
          `}
          Surah={`
              নূর
          `}
          Ayat={`
              ৩৩
          `}
        />
        উল্লিখিত যুগে একের অধিক নারী বিবাহ করে তাদের ন্যায্য পাওনা হ’তে বঞ্চিত
        করা হ’ত। তাদেরকে তালাক দিয়ে অন্যত্র স্বামী গ্রহণের অবকাশও দেওয়া হ’ত না।
        এ জাতীয় অমানবিক ও অমানুষিক যুলুম অত্যাচার নারী জাতির উপর করা হ’ত।
      </BanglaText>

      <BanglaText Heading={`বিভিন্ন ধর্ম ও সভ্যতায় নারী :`}>
        বিভিন্ন ধর্ম ও সভ্যতায় নারীদের অবস্থান নিম্নে তুলে ধরা হ’ল-
        <ul
          style={{
            listStyleType: 'disc',
            marginLeft: '30px',
          }}
        >
          <li
            style={{
              listStyleType: 'disc',
              marginBottom: '10px',
            }}
          >
            <BulletPoint>হিন্দু ধর্মে:</BulletPoint> নারীদেরকে বলী দেওয়া হ’ত এবং
            এ ধর্মে সতীদাহ প্রথা প্রচলিত ছিল। এছাড়াও এ ধর্মে নারীরা পিতার
            সম্পত্তি থেকে বঞ্চিত। হিন্দু ধর্মে নারীদের অতীব হীন ও নীচু স্তরের
            প্রাণী মনে করা হ’ত। এ দিকে ইঙ্গিত করেই Professor India গ্রন্থে বলা
            হয়েছে, There is no creature more sinful than woman. Woman is burning
            fire. She is the sharpedge of the razor she is verily all there in a
            body. অর্থাৎ ‘নারীর ন্যায় এত পাপ-পঙ্কিলতাময় প্রাণী জগতে আর নেই। নারী
            প্রজ্জ্বলিত অগ্নি স্বরূপ। সে ক্ষুরের ধারালো দিক। এই সমস্তই তার দেহে
            সন্নিবিষ্ট’।[1] নারীদের প্রতি ঘৃণাভরে বলা হয়েছে, Men should not love
            their অর্থাৎ ‘নারীদেরকে ভালবাসা পুরুষদের উচিৎ নয়’।[2]
          </li>
          <li
            style={{
              listStyleType: 'disc',
              marginBottom: '10px',
            }}
          >
            <BulletPoint>বৌদ্ধ ধর্মে :</BulletPoint>
            বৌদ্ধ ধর্মে নারীকে সকল পাপের জন্য দায়ী করা হ’ত। এ সম্পর্কে ঐতিহাসিক
            ওয়েষ্টমার্ক বলেন, Woman are of all the snares which the tempter has
            spead for man, the most dangerous; in woman are embodied all the
            powers of infatuation which blined the mind of the world. অর্থাৎ
            ‘মানুষের জন্য প্রলোভনের যতগুলি ফাঁদ বিস্তার করে রেখেছে, তন্মধ্যে
            নারীই সর্বাপেক্ষা বিপজ্জনক। নারীর মধ্যে সকল মোহিনী শক্তি অঙ্গীভূত
            হয়ে আছে, যা সমস্ত বিশ্বের মনকে অন্ধ করে দেয়’।[3]
          </li>
          <li
            style={{
              listStyleType: 'disc',
              marginBottom: '10px',
            }}
          >
            <BulletPoint>ইহুদী ধর্মে :</BulletPoint>এ ধর্মে নারীর প্রকৃতি
            সম্পর্কে বলা হয়েছে, ‘সতী নারীর চেয়ে পাপিষ্ট পুরুষও শতগুণে ভাল’।[4]
            তারা নারীকে যাবতীয় পাপ ও মন্দের মূল কারণ হিসাবে গণ্য করেছে। খৃষ্টান
            ধর্মে : খৃষ্টধর্ম মতে নারীরাই নরকের প্রবেশ দ্বার। সপ্তদশ শতাব্দীতে
            ‘কাউন্সিল অব দ্যা ওয়াইজ’-এর অধিবেশনে সর্বসম্মতিক্রমে এই সিদ্ধান্ত
            গৃহীত হয় 'Woman has no soul' ‘নারীর কোন আত্মা নেই’।[5]
          </li>
          <li
            style={{
              listStyleType: 'disc',
              marginBottom: '10px',
            }}
          >
            <BulletPoint>চীন সভ্যতায় :</BulletPoint>
            চীন দেশের নারীদের অবস্থার বিবরণ দিতে গিয়ে জনৈকা চীনা নারী বলেন,
            ‘মানব সমাজে নারীদের স্থান সর্বনিম্নে। অদৃষ্টের কি নির্মম পরিহাস!
            নারী সর্বাপেক্ষা হতভাগ্য প্রাণী। জগতে নারীর মত নিকৃষ্ট আর কিছু
            নেই’।[6]
          </li>
          <li
            style={{
              listStyleType: 'disc',
              marginBottom: '10px',
            }}
          >
            <BulletPoint>গ্রীক সভ্যতায় :</BulletPoint>
            বিশ্বখ্যাত গ্রীক দার্শনিক সক্রেটিস বলেন, 'Woman is the greates
            source of chaose and disruption in the world' ‘নারী জগতে বিশৃংখল ও
            ভাঙ্গনের সর্বশ্রেষ্ঠ উৎস’।[7]
          </li>
          <li
            style={{
              listStyleType: 'disc',
              marginBottom: '10px',
            }}
          >
            <BulletPoint>রোম সভ্যতায় :</BulletPoint>
            রোম সভ্যতায় পরিবারের নেতা ও পরিচালক পিতা বা স্বামী নিজের স্ত্রী ও
            সন্তানদের উপর নিরঙ্কুশ ক্ষমতার অধিকারী ছিল। তারা যখন ইচ্ছে তখনই
            নারীকে ঘর থেকে বহিষ্কার করে দিত।[8]
          </li>
        </ul>
      </BanglaText>

      <BanglaText Heading={`বর্তমান বিশ্বে নারীর অধিকার ও মর্যাদা : `}>
        বর্তমান বিশ্বেও নারীর যথাযথ অধিকার দেওয়া হচ্ছে না। তাদের ন্যায়সঙ্গত
        অধিকার হ’তে তাদেরকে বঞ্চিত করার মাধ্যমে তাদের উপর অত্যাচার করা হচ্ছে।
        পাশ্চাত্যবাদীরা নারী স্বাধীনতার নামে নারীদেরকে ঘরছাড়া করেছে। ইসলাম
        নারীদেরকে মর্যাদার যে উচ্চ আসনে অধিষ্ঠিত করেছিল, পাশ্চাত্যবাদীরা তা
        ক্ষুণ্ণ করে নারীদের আবার অনাচার আর দুষ্কর্মের শৃংখলে বন্দী করে ফেলেছে।
      </BanglaText>
      <BanglaText>
        পাশ্চাত্যবাদীরা পারিবারিক বন্ধনকে ভেঙ্গে নারীদেরকে নিজেদের অর্থ
        উপার্জনের মাধ্যম হিসাবে গড়ে তুলছে। আমেরিকা ও ইউরোপীয় দেশগুলোতে এমনকি
        আমাদের দেশেও ৮৫% নারী ধনতন্ত্রবাদের সেবায় নিজেদের বিলিয়ে দেয়। পাশ্চাত্য
        সভ্যতা আজ নারীদেরকে অপরের ইচ্ছার পুতুল বানিয়ে তাদেরকে বাজারের পণ্য ও
        ফ্যাশনের প্রতীক হিসাবে ব্যবহার করছে এবং খদ্দেরদের দৃষ্টি আকর্ষণ করার
        জন্য নারীদের বিভিন্নভাবে উপস্থাপন করছে। যেমন- নারীদের নগ্ন ও অশ্লীল ছবি,
        নারী বিষয়ক নানান অশ্লীল গল্প, কবিতা, উপন্যাস, অশ্লীল সিনেমা ইন্টারনেট সহ
        বিভিন্ন প্রচার মাধ্যমে সারা বিশ্বে ছড়িয়ে দিয়েছে। ফলে যুব সমাজ এমনকি
        বৃদ্ধদেরও মানষিক বিকৃতি ঘটছে। এভাবে পাশ্চাত্য সভ্যতা নারীদেরকে তাদের
        উন্নত মর্যাদার আসন থেকে টেনে নীচে নামিয়ে আনছে। অল্প কথায়, নারীর মর্যাদা
        দানের পরিবর্তে নারী জাতির প্রতি দিন দিন অমর্যাদা ও অবমাননাই বৃদ্ধি
        পাচ্ছে।
      </BanglaText>

      <AlertDialog
        motionPreset="slideInBottom"
        leastDestructiveRef={cancelRef}
        onClose={onClose}
        isOpen={isOpen}
        isCentered
      >
        <AlertDialogOverlay />
        <AlertDialogContent>
          <AlertDialogBody>
            অনুমতি ব্যতিত ব্লগের কোনো পোস্ট কপি করে অন্যত্র প্রকাশ করা যাবে না।
            করা হলে তা লেখকের হক নষ্ট করা হচ্ছে বলে গণ্য হবে।
          </AlertDialogBody>
          <AlertDialogCloseButton bg={'red.500'} />
        </AlertDialogContent>
      </AlertDialog>
    </Container>
  );
}
